import React from 'react';

const DescriptionTopic = () => {
  return (
    <p>
      Гуманитарная программа иммиграции Application on Humanitarian and Compassionate Grounds дает возможность лицам, которые находятся в исключительных обстоятельствах, подавать заявления на получение статуса постоянного жителя Канады на основании исключения из существующих правил, но в рамках действующего иммиграционного законодательства. В некоторых случаях, люди, уже живущие в Канаде, но не имеющие возможности получить вид на жительство по общедоступным иммиграционным программам, могут получить его по гуманитарной программе, исходя из соображений гуманности и сострадания.
      <br/><br/>
      Иначе говоря, заявителями по гуманитарной программе являются те, кто при подаче по любой другой программе получили бы отказ.
      <br/><br/>
      Основные правила гуманитарной программы:
    </p>
  );
};

export default DescriptionTopic;
