import React, { useState } from 'react';
import './FAQ.sass';
import { Accordion, Card, useAccordionToggle } from 'react-bootstrap';
import collapseArrow from '../../../images/other/collapseArrow.png';

const Question = ({ eventKey, title, text }) => {
  const [isActive, toggleActive] = useState(eventKey === '0');

  const hadleQuestionCollapse = useAccordionToggle(eventKey, () => {
    toggleActive((prev) => !prev);
  });

  const indicatorClass = isActive ? 'question-indicator active' : 'question-indicator disabled';
  const buttonClass = isActive ? 'question-collapse-button active' : 'question-collapse-button disabled';

  return (
    <Card className="question">
      <Card.Header className="question-card">
        <div className={indicatorClass} />
        <h5>{title}</h5>
        <button className={buttonClass} onClick={hadleQuestionCollapse}>
          <img src={collapseArrow} />
        </button>
      </Card.Header>
      <Accordion.Collapse className="question-text" eventKey={eventKey}>
        <p>{text}</p>
      </Accordion.Collapse>
    </Card>
  );
};

const FAQ = () => {
  return (
    <Accordion defaultActiveKey="0">
      <Question eventKey="0" title="Хочу иммигрировать, лол" text="Каждый иммигрант в Канаде однозначно разный, и соответственно методы для
      иммиграции также разные. Все зависит от личных качеств, жизненной ситуации, поставленных целей в карьере, и
      даже семейных обстоятельств. Учитывая все обстоятельства, Канада имеет превосходные федеральные и
      провинциальные программы предназначенные для гарантированного успеха и приобретения положительного
      иммиграционного опыта для всех. В настоящее время существует более 60 программ, доступных для новых иммигрантов. Отличный старт для новичков,
      это определиться с программой, которая наиболее всего подходит. Категории имеют широкий диапазон и
      предназначены для специалистов, квалифицированных рабочих, предпринимателей, воспитателей и инвесторов. Не
      забываем и то, что канадские граждане могут фактически спонсировать членов семьи для иммиграции." />
      <Question eventKey="1" title="Хочу иммигрировать, лол" text="Каждый иммигрант в Канаде однозначно разный, и соответственно методы для
      иммиграции также разные. Все зависит от личных качеств, жизненной ситуации, поставленных целей в карьере, и
      даже семейных обстоятельств. Учитывая все обстоятельства, Канада имеет превосходные федеральные и
      провинциальные программы предназначенные для гарантированного успеха и приобретения положительного
      иммиграционного опыта для всех. В настоящее время существует более 60 программ, доступных для новых иммигрантов. Отличный старт для новичков,
      это определиться с программой, которая наиболее всего подходит. Категории имеют широкий диапазон и
      предназначены для специалистов, квалифицированных рабочих, предпринимателей, воспитателей и инвесторов. Не
      забываем и то, что канадские граждане могут фактически спонсировать членов семьи для иммиграции." />
      <Question eventKey="2" title="Хочу иммигрировать, лол" text="Каждый иммигрант в Канаде однозначно разный, и соответственно методы для
      иммиграции также разные. Все зависит от личных качеств, жизненной ситуации, поставленных целей в карьере, и
      даже семейных обстоятельств. Учитывая все обстоятельства, Канада имеет превосходные федеральные и
      провинциальные программы предназначенные для гарантированного успеха и приобретения положительного
      иммиграционного опыта для всех. В настоящее время существует более 60 программ, доступных для новых иммигрантов. Отличный старт для новичков,
      это определиться с программой, которая наиболее всего подходит. Категории имеют широкий диапазон и
      предназначены для специалистов, квалифицированных рабочих, предпринимателей, воспитателей и инвесторов. Не
      забываем и то, что канадские граждане могут фактически спонсировать членов семьи для иммиграции." />
      <Question eventKey="3" title="Хочу иммигрировать, лол" text="Каждый иммигрант в Канаде однозначно разный, и соответственно методы для
      иммиграции также разные. Все зависит от личных качеств, жизненной ситуации, поставленных целей в карьере, и
      даже семейных обстоятельств. Учитывая все обстоятельства, Канада имеет превосходные федеральные и
      провинциальные программы предназначенные для гарантированного успеха и приобретения положительного
      иммиграционного опыта для всех. В настоящее время существует более 60 программ, доступных для новых иммигрантов. Отличный старт для новичков,
      это определиться с программой, которая наиболее всего подходит. Категории имеют широкий диапазон и
      предназначены для специалистов, квалифицированных рабочих, предпринимателей, воспитателей и инвесторов. Не
      забываем и то, что канадские граждане могут фактически спонсировать членов семьи для иммиграции." />
    </Accordion>
  );
};

export default FAQ;
{/*<div className="question-wrapper">*/}
{/*  <div className="question">*/}
{/*    <div className="question-indicator disabled" />*/}
{/*    <h5>Хочу иммигрировать в Канаду, с чего начать?</h5>*/}
{/*    <button onClick={toggleQuestion} />*/}
{/*  </div>*/}
{/*  { visible &&*/}
{/*  <div className="content"><p>Каждый иммигрант в Канаде однозначно разный, и соответственно методы для*/}
{/*    иммиграции также разные. Все зависит от личных качеств, жизненной ситуации, поставленных целей в карьере, и*/}
{/*    даже семейных обстоятельств. Учитывая все обстоятельства, Канада имеет превосходные федеральные и*/}
{/*    провинциальные программы предназначенные для гарантированного успеха и приобретения положительного*/}
{/*    иммиграционного опыта для всех.*/}
{/*    В настоящее время существует более 60 программ, доступных для новых иммигрантов. Отличный старт для новичков,*/}
{/*    это определиться с программой, которая наиболее всего подходит. Категории имеют широкий диапазон и*/}
{/*    предназначены для специалистов, квалифицированных рабочих, предпринимателей, воспитателей и инвесторов. Не*/}
{/*    забываем и то, что канадские граждане могут фактически спонсировать членов семьи для иммиграции.*/}
{/*  </p></div>*/}
{/*  }*/}
{/*</div>*/}
