import React, { useCallback, useState } from 'react';
import './FAQ.sass';
import { Accordion, Card } from 'react-bootstrap';
import collapseArrow from '../../../images/other/collapseArrow.png';

const Question = ({ setActiveKey, eventKey, title, text, activeKey }) => {

  const hadleQuestionCollapse = useCallback(() => {
    setActiveKey(eventKey);
  }, [setActiveKey, eventKey]);

  const isActive = activeKey === eventKey;
  const indicatorClass = `question-indicator ${isActive ? 'active' : 'disabled'}`;
  const buttonClass = `question-collapse-button ${isActive ? 'active' : 'disabled'}`;

  return (
    <Card className="question">
      <Card.Header className="question-card">
        <div className={indicatorClass} />
        <h5>{title}</h5>
        <button className={buttonClass} onClick={hadleQuestionCollapse}>
          <img src={collapseArrow} alt="collapse-arrow" />
        </button>
      </Card.Header>
      <Accordion.Collapse className="question-text" eventKey={eventKey}>
        <p>{text}</p>
      </Accordion.Collapse>
    </Card>
  );
};

const FAQ = () => {



  const [activeKey, setActiveKey] = useState('0');

  return (
    <Accordion className="questions-wrapper" activeKey={activeKey}>
      <Question setActiveKey={setActiveKey} activeKey={activeKey} eventKey="0" title="Хочу иммигрировать, лол" text="Каждый иммигрант в Канаде однозначно разный, и соответственно методы для
      иммиграции также разные. Все зависит от личных качеств, жизненной ситуации, поставленных целей в карьере, и
      даже семейных обстоятельств. Учитывая все обстоятельства, Канада имеет превосходные федеральные и
      провинциальные программы предназначенные для гарантированного успеха и приобретения положительного
      иммиграционного опыта для всех. В настоящее время существует более 60 программ, доступных для новых иммигрантов. Отличный старт для новичков,
      это определиться с программой, которая наиболее всего подходит. Категории имеют широкий диапазон и
      предназначены для специалистов, квалифицированных рабочих, предпринимателей, воспитателей и инвесторов. Не
      забываем и то, что канадские граждане могут фактически спонсировать членов семьи для иммиграции." />
      <Question setActiveKey={setActiveKey} activeKey={activeKey} eventKey="1" title="Хочу иммигрировать, лол" text="Каждый иммигрант в Канаде однозначно разный, и соответственно методы для
      иммиграции также разные. Все зависит от личных качеств, жизненной ситуации, поставленных целей в карьере, и
      даже семейных обстоятельств. Учитывая все обстоятельства, Канада имеет превосходные федеральные и
      провинциальные программы предназначенные для гарантированного успеха и приобретения положительного
      иммиграционного опыта для всех. В настоящее время существует более 60 программ, доступных для новых иммигрантов. Отличный старт для новичков,
      это определиться с программой, которая наиболее всего подходит. Категории имеют широкий диапазон и
      предназначены для специалистов, квалифицированных рабочих, предпринимателей, воспитателей и инвесторов. Не
      забываем и то, что канадские граждане могут фактически спонсировать членов семьи для иммиграции." />
      <Question setActiveKey={setActiveKey} activeKey={activeKey} eventKey="2" title="Хочу иммигрировать, лол" text="Каждый иммигрант в Канаде однозначно разный, и соответственно методы для
      иммиграции также разные. Все зависит от личных качеств, жизненной ситуации, поставленных целей в карьере, и
      даже семейных обстоятельств. Учитывая все обстоятельства, Канада имеет превосходные федеральные и
      провинциальные программы предназначенные для гарантированного успеха и приобретения положительного
      иммиграционного опыта для всех. В настоящее время существует более 60 программ, доступных для новых иммигрантов. Отличный старт для новичков,
      это определиться с программой, которая наиболее всего подходит. Категории имеют широкий диапазон и
      предназначены для специалистов, квалифицированных рабочих, предпринимателей, воспитателей и инвесторов. Не
      забываем и то, что канадские граждане могут фактически спонсировать членов семьи для иммиграции." />
      <Question setActiveKey={setActiveKey} activeKey={activeKey} eventKey="3" title="Хочу иммигрировать, лол" text="Каждый иммигрант в Канаде однозначно разный, и соответственно методы для
      иммиграции также разные. Все зависит от личных качеств, жизненной ситуации, поставленных целей в карьере, и
      даже семейных обстоятельств. Учитывая все обстоятельства, Канада имеет превосходные федеральные и
      провинциальные программы предназначенные для гарантированного успеха и приобретения положительного
      иммиграционного опыта для всех. В настоящее время существует более 60 программ, доступных для новых иммигрантов. Отличный старт для новичков,
      это определиться с программой, которая наиболее всего подходит. Категории имеют широкий диапазон и
      предназначены для специалистов, квалифицированных рабочих, предпринимателей, воспитателей и инвесторов. Не
      забываем и то, что канадские граждане могут фактически спонсировать членов семьи для иммиграции." />
    </Accordion>
  );
};

export default FAQ;
